feat: doc (#5)
* test

* feat: doc
